import { images } from "@/utils/constants";

export const content = {
  'inovative-solutions': {
    category: 'Інноваційні та цифрові рішення для забезпечення безпеки на роботі',
    title: 'Онлайн Голосування - Конкурс "Інноваційні та цифрові рішення для забезпечення безпеки на роботі"',
    subtitle: 'Ми раді представити вам найкращі роботи першого етапу конкурсу "Інноваційні та цифрові рішення для забезпечення безпеки на роботі". Ваш голос допоможе визначити переможців другого етапу. Підтримайте кращі проєкти та віддайте свій голос за ті, які вас надихнули найбільше.',
    img: images.categories.category1,
    description: [
      'Перегляньте представлені роботи:',
      [
        'a. Всі роботи поділені за категоріями: презентації, відеоролики та інші матеріали.',
        'b. Прокручуйте сторінку вниз, щоб переглянути всі роботи.',
      ],
      'Проставте лайки:',
      [
        'a. Натисніть на значок "лайк" під кожною роботою, яка вам сподобалася.',
        'b. Ви можете голосувати за необмежену кількість робіт',
      ],
      'Результати голосування:',
      [
        'a. Голосування триватиме з 1 липня по 31 серпня включно.',
        'b. Роботи, що отримають найбільшу кількість лайків, стануть переможцями.',
      ],
    ],
    support: {
      title: 'Підтримайте Інноваційні Проєкти',
      content: 'Ваш голос має значення! Долучіться до спільноти однодумців, які цінують інноваційні підходи до забезпечення безпеки праці та готові поділитися своїм досвідом. Ваша підтримка допоможе визначити найкращі проєкти та відзначити тих, хто доклав максимум зусиль для популяризації безпечного робочого середовища.',
    },
    winners: {
      title: 'Переможці та Відзнаки',
      content: 'Результати конкурсу будуть оголошені в період з 1 по 3 вересня. Переможці отримають відзнаки від Держпраці, а інформація про них буде розміщена на інформаційних ресурсах Держпраці, її територіальних органів та партнерів.'
    },
    final: 'Дякуємо за вашу активну участь та підтримку! Голосуйте за майбутнє безпечної праці разом з нами!'
  },
  'best-specialist': {
    category: 'Кращий спеціаліст з охорони праці',
    title: 'Кращий спеціаліст з охорони праці',
    subtitle: 'Тут кожен спеціаліст з охорони праці може заявити про себе як про найкращого фахівця, що має максимальну ефективність та є суперпрофесіоналом. Хочете потішити себе та свого роботодавця – вам сюди!',
    img: images.categories.category2,
    description: [
      'На платформі ratingop.expertus.com.ua спеціалісти з охорони праці мають унікальну можливість випробувати себе, а також увійти до десятки найкращих фахівців України.',
      'Мета Рейтингу - підвищити професійну кваліфікацію працівників служб охорони праці підприємств, установ і організацій.',
      'Участь у конкурсі можуть взяти всі бажаючі фахівці з охорони праці, які безпосередньо реалізують функції щодо створення безпечних і здорових умов праці.',
      'Конкурс складається з тесту, де учасники відповідають на питання з охорони праці. Тест охоплює широке коло питань в аспектах, які пов’язані з безпекою працівника, зокрема можуть трапитися вузькі галузеві запитання. При цьому учасники мають необмежену кількість спроб, щоб набрати максимум балів і дізнатися щось нове. Рейтинг учасників формується відповідно до кількості правильних відповідей, і чим більше правильних відповідей ви надаєте, тим вище ваше місце в рейтингу.',
      'Рейтинг призначений для практиків, тож у ТОП-10 не потраплятимуть представники фахових періодичних видань, а також особи, які консультують із питань охорони праці на платній основі.'
    ],
    support: {
      title: '',
      content: '',
    },
    winners: {
      title: '',
      content: ''
    },
    final: ''
  },
  'effective-support': {
    category: 'Ефективні програми психосоціальної підтримки на роботі та її реалізація',
    title: 'Онлайн Голосування - Конкурс "Ефективні програми психосоціальної підтримки на роботі та її реалізація"',
    subtitle: 'Ми раді представити вам найкращі програми першого етапу конкурсу "Ефективні програми психосоціальної підтримки на роботі та її реалізація". Ваш голос допоможе визначити переможців другого етапу. Підтримайте кращі проєкти та віддайте свій голос за ті, які вас надихнули найбільше.',
    img: images.categories.category3,
    description: [
      'Перегляньте представлені роботи:',
      [
        'a. Всі роботи поділені за категоріями: презентації, відеоролики та інші матеріали.',
        'b. Прокручуйте сторінку вниз, щоб переглянути всі роботи.',
      ],
      'Проставте лайки:',
      [
        'a. Натисніть на значок "лайк" під кожною роботою, яка вам сподобалася.',
        'b. Ви можете голосувати за необмежену кількість робіт',
      ],
      'Результати голосування:',
      [
        'a. Голосування триватиме з 1 липня по 31 серпня включно.',
        'b. Роботи, що отримають найбільшу кількість лайків, стануть переможцями.',
      ],
    ],
    support: {
      title: 'Підтримайте Інноваційні Програми',
      content: 'Ваш голос має значення! Долучіться до спільноти однодумців, які цінують психосоціальну підтримку на робочому місці та готові поділитися своїм досвідом. Ваша підтримка допоможе визначити найкращі програми та відзначити тих, хто доклав максимум зусиль для популяризації здорового робочого середовища.',
    },
    winners: {
      title: 'Переможці та Відзнаки',
      content: 'Результати конкурсу будуть оголошені в період з 1 по 3 вересня. Переможці отримають відзнаки від Держпраці, а інформація про них буде розміщена на інформаційних ресурсах Держпраці, її територіальних органів та партнерів.'
    },
    final: 'Дякуємо за вашу активну участь та підтримку! Голосуйте за майбутнє здорової праці разом з нами!'
  },
  'art': {
    category: 'Мистецтво, що рятує життя',
    title: 'Онлайн Голосування - Конкурс "Мистецтво, що рятує життя"',
    subtitle: 'Ми раді представити вам найкращі роботи першого етапу конкурсу "Мистецтво, що рятує життя". Ваш голос допоможе визначити переможців другого етапу. Підтримайте кращі роботи та віддайте свій голос за ті, які вас надихнули найбільше.\nЯк Голосувати:',
    img: images.categories.category4,
    description: [
      'Перегляньте представлені роботи:',
      [
        'a. Всі роботи поділені за категоріями: постери, плакати, фото, малюнки та відеоролики.',
        'b. Прокручуйте сторінку вниз, щоб переглянути всі роботи.',
      ],
      'Проставте лайки:',
      [
        'a. Натисніть на значок "лайк" під кожною роботою, яка вам сподобалася.',
        'b. Ви можете голосувати за необмежену кількість робіт',
      ],
      'Результати голосування:',
      [
        'a. Голосування триватиме з 1 липня по 31 серпня включно.',
        'b. Роботи, що отримають найбільшу кількість лайків, стануть переможцями.',
      ],
    ],
    support: {
      title: 'Підтримайте Талановитих Творців',
      content: 'Ваш голос має значення! Долучіться до спільноти однодумців, які цінують безпеку праці та творчий підхід до її зображення. Ваша підтримка допоможе визначити найкращі роботи та відзначити тих, хто доклав максимум зусиль для популяризації важливості безпечного робочого середовища.',
    },
    winners: {
      title: 'Переможці та Відзнаки',
      content: 'Результати конкурсу будуть оголошені в період з 1 по 3 вересня. Переможці отримають відзнаки від Держпраці, а інформація про них буде розміщена на інформаційних ресурсах Держпраці, її територіальних органів та партнерів.'
    },
    final: 'Дякуємо за вашу активну участь та підтримку! Голосуйте за майбутнє безпечної праці разом з нами!'
  },
};
