import { images } from "@/utils/constants";

export const content = {
  'inovative-solutions': {
    title: 'Інноваційні та цифрові рішення для забезпечення безпеки на роботі',
    subtitle: 'Цей розділ для творців, які вміють викласти свої почуття на папері. Знаєте як виглядає безпечна праця? Вам сюди! Немає значення, скільки вам років, вмієте ви малювати чи користуєтеся відповідним програмним забезпеченням. Фантазія і почуття – ось що робить ескіз, постер, малюноквитвором мистецтва',
    img: images.categories.category1,
    description: [
      'Участь у конкурсі можуть брати юридичні та фізичні особи – підприємці усіх видів діяльності та форм власності, які використовують найману працю, та запровадили інноваційні та цифрові рішення для забезпечення безпеки на роботі в системі управління охорони праці на підприємстві.',
      'Для участі у конкурсі уповноважений представник роботодавця має зареєструватися та завантажити презентаційні матеріали: презентацію у форматі pdf та/або відеоролик у форматі mp4.',
      'Реєстрація та завантаження матеріалів здійснюється з 28 квітня по 28 червня. ',
      'Для оцінки відповідності матеріалів заявленій темі Держпраці створюється журі за участю представників центральних органів виконавчої влади та сторін соціального діалогу. Мінімальна кількість членів журі – 7 осіб.',
      'Після вивчення журі отриманих матеріалів на відповідність заявленій темі вони розміщуються на порталі та стають доступними для всіх бажаючих (без можливості завантаження) для розгляду та голосування. Голосування триватиме з 1 липня по 31 серпня включно.',
      'Рішення, що наберуть найбільшу кількість голосів, будуть відзначені дипломами Держпраці.'
    ]
  },
  'best-specialist': {
    title: 'Кращий спеціаліст з охорони праці',
    subtitle: 'Тут кожен спеціаліст з охорони праці може заявити просебе як про найкращого фахівця, що має максимальну ефективність   та є суперпрофесіоналом. Хочете потішити себе та свого роботодавця – вам сюди!',
    img: images.categories.category2,
    description: [
      'На платформі ratingop.expertus.com.ua спеціалісти з охорони праці мають унікальну можливість випробувати себе, а також увійти до десятки найкращих фахівців України.',
      'Мета Рейтингу - підвищити професійну кваліфікацію працівників служб охорони праці підприємств, установ і організацій.',
      'Участь у конкурсі можуть взяти всі бажаючі фахівці з охорони праці, які безпосередньо реалізують функції щодо створення безпечних і здорових умов праці.',
      'Конкурс складається з тесту, де учасники відповідають на питання з охорони праці. Тест охоплює широке коло питань в аспектах, які пов’язані з безпекою працівника, зокрема можуть трапитися вузькі галузеві запитання. При цьому учасники мають необмежену кількість спроб, щоб набрати максимум балів і дізнатися щось нове. Рейтинг учасників формується відповідно до кількості правильних відповідей, і чим більше правильних відповідей ви надаєте, тим вище ваше місце в рейтингу.',
      'Рейтинг призначений для практиків, тож у ТОП-10 не потраплятимуть представники фахових періодичних видань, а також особи, які консультують із питань охорони праці на платній основі.'
    ]
  },
  'effective-support': {
    title: 'Ефективні програми психосоціальної підтримки на роботі та її реалізація',
    subtitle: 'Це про роботодавців, які розуміють, що таке успішний бізнес знайпродуктивнішою командою професіоналіві однодумців. Якщо ви знаєте, якзробити команду такою, і ви вже це зробили чи намагаєтеся це зробити –  цей розділ для вас.',
    img: images.categories.category3,
    description: [
      'Участь у конкурсі беруть юридичні та фізичні особи – підприємці всіх видів діяльності та форм власності з території всієї України, які дбають про ментальне здоров’я своїх працівників та запровадили або запроваджують психосоціальну підтримку працівників на робочому місці.',
      'Для участі у конкурсі уповноважений представник роботодавця має зареєструватися та завантажити презентаційні матеріали: презентацію у форматі pdf  та/або відеоролик у форматі mp4.',
      'Реєстрація та завантаження матеріалів здійснюється з 28 квітня по 28 червня.',
      'Для оцінки відповідності матеріалів заявленій темі Держпраці створюється журі за участю представників центральний органів виконавчої влади та сторін соціального діалогу. Мінімальна кількість членів журі – 7 осіб.',
      'Після вивчення журі отриманих матеріалів на відповідність заявленій темі вони розміщуються на порталі та стають доступними для всіх бажаючих (без можливості завантаження) для розгляду та голосування. Голосування триватиме з 1 липня по 31 серпня включно.',
      'Рішення, що наберуть найбільшу кількість голосів, будуть відзначені дипломами Держпраці.'
    ]
  },
  'art': {
    title: 'Мистецтво, що рятує життя',
    subtitle: 'Цей розділ для творців, які вміють викласти свої почуття напапері. Знаєте як виглядає безпечна праця? Вам сюди! Немає значення, скільки вам років, вмієте ви малювати чи користуєтеся відповідним програмним забезпеченням. Фантазія і почуття – ось що робить ескіз, постер, малюноквитвором мистецтва.',
    img: images.categories.category4,
    description: [
      'Участь у конкурсі можуть брати всі бажаючі без обмеження за віком, зайнятістю та місцем проживання.',
      `До участі у конкурсі приймаються будь-які візуальні матеріали та зображення на теми охорони праці, здорового робочого місця, безпечного виконання робіт, зокрема:
        a. Постери чи інформаційні плакати, створені вручну або за допомогою програмного забезпечення;
        b. Художні фото, колажі чи зображення, створені на основі фото;
        c. Малюнки, виконані вручну на будь-якому матеріалі і в будь-якій техніці малювання;
        d. Інші графічні зображення;
        e. Відеоролики (мультиплікаційні, документальні, художні).
      `,
      'Роботи мають бути створені учасниками особисто і відповідати заявленій темі. Роботи на інші теми до участі не допускаються. Конкурс проходить у різних вікових категоріях.',
      'Для участі у конкурсі учасники особисто реєструються на порталі та завантажують свої роботи у форматі jpg, jpeg або png. Одночасно із надсиланням робіт учасниками (за бажанням) може надаватися згода на продаж їх творів (в електронному вигляді) через аукціон з подальшим направленням коштів на потреби Збройних Сил України. У разі, якщо учасник є неповнолітнім, до заявки долучається згода одного з батьків.',
      'Конкурс відбувається в два етапи: обласний та національний.',
      'Для оцінки робіт при міжрегіональних управліннях Держпраці створюються журі за участі представників соціальних партнерів, органів місцевої влади та місцевого самоврядування. Мінімальна кількість членів журі – 7 осіб в області. Склад журі затверджується керівником відповідного міжрегіонального управління.',
      'Журі міжрегіонального управління Держпраці оцінює зміст робіт на відповідність заявлений темі та визначає переможців 1 етапу. Про перемогу на 1 етапі учасники повідомляються шляхом направлення відповідного повідомлення на електронну пошту.',
      'Роботи – переможці 1 етапу розміщуються на порталі для онлайн голосування, яке відкривається 1 липня і триває по 31 серпня включно.',
      'Результати конкурсу оголошуються в період з 1 по 3 вересня шляхом розміщення інформації на вебсайті Держпраці.',
      'Переможці конкурсу будуть нагороджені відзнаками Держпраці. Інформація про переможців конкурсу буде розміщена на інформаційних ресурсах Держпраці, її територіальних органів та партнерів.'
    ]
  },
};
