import { images } from "@/utils/constants";

export const content = {
  'inovative-solutions': {
    title: 'Інноваційні та цифрові рішення для забезпечення безпеки на роботі',
    subtitle: 'Цей розділ для творців, які вміють викласти свої почуття на папері. Знаєте як виглядає безпечна праця? Вам сюди! Немає значення, скільки вам років, вмієте ви малювати чи користуєтеся відповідним програмним забезпеченням. Фантазія і почуття – ось що робить ескіз, постер, малюноквитвором мистецтва',
    img: images.categories.category1,
  },
  'best-specialist': {
    title: 'Кращий спеціаліст з охорони праці',
    subtitle: 'Тут кожен спеціаліст з охорони праці може заявити просебе як про найкращого фахівця, що має максимальну ефективність   та є суперпрофесіоналом. Хочете потішити себе та свого роботодавця – вам сюди!',
    img: images.categories.category2,
  },
  'effective-support': {
    title: 'Ефективні програми психосоціальної підтримки на роботі та її реалізація',
    subtitle: 'Це про роботодавців, які розуміють, що таке успішний бізнес знайпродуктивнішою командою професіоналіві однодумців. Якщо ви знаєте, якзробити команду такою, і ви вже це зробили чи намагаєтеся це зробити –  цей розділ для вас.',
    img: images.categories.category3,
  },
  'art': {
    title: 'Мистецтво, що рятує життя',
    subtitle: 'Цей розділ для творців, які вміють викласти свої почуття напапері. Знаєте як виглядає безпечна праця? Вам сюди! Немає значення, скільки вам років, вмієте ви малювати чи користуєтеся відповідним програмним забезпеченням. Фантазія і почуття – ось що робить ескіз, постер, малюноквитвором мистецтва.',
    img: images.categories.category4,
  },
};
