import { Input } from "../Input";

export const Form = () => {
  return (
    <form className="mt-8 space-y-6">
      <Input
        label="Назва підприємства, установи, організації, фізичної особи – підприємця"
        placeholder="Введіть назву підприємства, установи, організації, фізичної особи – підприємця"
      />

      <Input
        label="Основний вид діяльності"
        placeholder="Введіть основний вид діяльності"
      />

      <Input
        label="Область, в якій знаходиться роботодавець"
        placeholder="Введіть область, в якій знаходиться роботодавець"
      />

      <Input
        label="Населений пункт, в якому розміщений роботодавець"
        placeholder="Введіть населений пункт, в якому розміщений роботодавець"
      />

      <Input
        label="Кількість працівників"
        placeholder="Введіть кількість працівників"
      />

      <h3 className="text-lg font-semibold">Контактна особа</h3>

      <Input
        label="Назва підприємства, установи, організації, фізичної особи – підприємця"
        placeholder="Введіть назву підприємства, установи, організації, фізичної особи – підприємця"
      />

    </form>
  )
}
