import { images } from "@/utils/constants";
import { Pages } from "@/utils/enums";

export const content = {
  [Pages.inovativeSolutions]: {
    category: 'Інноваційні та цифрові рішення для забезпечення безпеки на роботі',
    title: (isVoteEnabled: boolean) => isVoteEnabled 
      ? 'Онлайн голосування - Інноваційні та цифрові рішення для забезпечення безпеки на роботі'
      : 'Інноваційні та цифрові рішення для забезпечення безпеки на роботі',
    subtitle: (isVoteEnabled: boolean) => isVoteEnabled
      ? 'Вітаємо на сторінці голосування!\nМи раді представити вам найкращі роботи у номінації «Інноваційні та цифрові рішення для забезпечення безпеки на роботі». Ваш голос допоможе визначити найкращих. Переглядайте роботи і обирайте ті, що найбільш вас надихнули.'
      : 'Ця номінація тільки для роботодавців, що випереджають час і чітко розуміють ціну інновацій та цифрових рішень. Якщо ви успішно впровадили або впроваджуєте сучасні підходи в систему охорони праці, виявлення небезпек, попередження аварій тощо – поділіться досвідом!',
    img: images.categories.category1,
    description: (isVoteEnabled: boolean) => isVoteEnabled
      ? [
          'Переглянути всі роботи. Прокручуйте сторінку вниз, щоб переглянути всі роботи.',
          'Поставте лайки (натисніть на значок «лайк» під кожною роботою, що вам сподобається. Ви можете голосувати за необмежену кількість робіт.',
          'Голосування триватиме з 1 липня по 31 жовтня включно. Переможцями стануть програми, що отримають найбільшу кількість лайків станом на 00:00 годин 1 листопада.',
        ]
      : [
          'Участь у конкурсі можуть брати юридичні особи та фізичні особи – підприємці всіх видів діяльності та форм власності з території всієї України, які використовують найману працю та запровадили інноваційні та цифрові рішення для забезпечення безпеки на роботі.',
          'Для участі уповноважений представник роботодавця має зареєструватися та завантажити презентаційні матеріали: презентацію у форматі pdf та/або відеоролик у форматі mp4.',
          'Реєстрація та завантаження матеріалів триватиме з 28.04.2025 по 20.07.2025.',
          'Для оцінки відповідності матеріалів заявленій темі Держпраці створюється журі за участі представників центральний органів виконавчої влади та сторін соціального діалогу. Мінімальна кількість членів журі – 7 осіб.',
          'Після вивчення журі отриманих матеріалів на відповідність заявленій темі вони розміщуються на порталі та стають доступними для всіх бажаючих (без можливості завантаження) для розгляду та голосування. Голосування триватиме з 1 серпня по 31 жовтня включно.',
          'Рішення, що наберуть найбільшу кількість голосів, будуть відзначені Держпраці.',
        ],
    support: {
      title: (isVoteEnabled: boolean) => isVoteEnabled ? 'Підтримайте наших учасників своїми «лайками»!' : '',
      content: (isVoteEnabled: boolean) => isVoteEnabled ? 'Дякуємо за активну участь та підтримку проєкту!' : '',
    },
    winners: {
      title: 'Переможці та Відзнаки',
      content: 'Результати конкурсу будуть оголошені в період з 1 по 3 листопада. Переможці отримають відзнаки від Держпраці, а інформація про них буде розміщена на інформаційних ресурсах Держпраці, її територіальних органів та партнерів.'
    },
    final: (isVoteEnabled: boolean) => isVoteEnabled ? 'Дякуємо за вашу активну участь та підтримку! Голосуйте за майбутнє безпечної праці разом з нами!' : ''
  },
  [Pages.bestSpecialist]: {
    category: 'Кращий спеціаліст з охорони праці',
    title: 'Кращий спеціаліст з охорони праці',
    subtitle: 'Бажаєте заявити про себе як про професіонала суперкласу? Хочете потішити себе і свого роботодавця? Запрошуємо до рейтингу найкращих фахівців!',
    img: images.categories.category2,
    description: [
      'Перейти за посиланням на платформу ratingop.expertus.com.ua та отримати унікальну можливість випробувати себе, а також увійти до найкращих фахівців з охорони праці України. Відповідайте на запитання, розглядайте практичні завдання, будьте активними та уважними!',
      'Мета Рейтингу — підвищити професійну кваліфікацію працівників служб охорони праці підприємств, установ і організацій та відзначити найкращих.',
      'Участь у конкурсі можуть взяти всі бажаючі фахівці з охорони праці, які безпосередньо реалізують функції щодо створення безпечних і здорових умов праці.',
      'Рейтинг призначений для практиків, тож у ТОП-10 не потраплятимуть працівники Держпраці,  представники фахових періодичних видань, а також особи, які консультують із питань охорони праці на платній основі.',
      'Найкращі фахівці будуть відзначені Держпраці.',
    ],
    support: {
      title: '',
      content: '',
    },
    winners: {
      title: '',
      content: ''
    },
    final: ''
  },
  [Pages.effectiveSupport]: {
    category: 'Ефективні програми психосоціальної підтримки на роботі та її реалізація',
    title: (isVoteEnabled: boolean) => isVoteEnabled 
      ? 'Онлайн голосування - Ефективні програми психосоціальної підтримки на роботі та її реалізація'
      : 'Ефективні програми психосоціальної підтримки на роботі та її реалізація',
    subtitle: (isVoteEnabled: boolean) => isVoteEnabled
      ? 'Вітаємо на сторінці голосування!\nМи раді представити вам найкращі роботи у номінації «Ефективні програми психосоціальної підтримки на роботі та її реалізація». Ваш голос допоможе визначити найкращих. Переглядайте роботи і обирайте ті, що найбільш вас надихнули.'
      : 'Ця номінація для роботодавців, які розуміють, що успішний бізнес – це продуктивна команда професіоналів – однодумців. Якщо ви на шляху до успіху, якщо ваша команда саме така або ви робите для цього перші кроки – ця номінація для вас!',
    img: images.categories.category3,
    description: (isVoteEnabled: boolean) => isVoteEnabled
      ? [
          'Переглянути всі роботи. Прокручуйте сторінку вниз, щоб переглянути всі роботи.',
          'Поставте лайки (натисніть на значок «лайк» під кожною роботою, що вам сподобається. Ви можете голосувати за необмежену кількість робіт.',
          'Голосування триватиме з 1 липня по 31 жовтня включно. Переможцями стануть програми, що отримають найбільшу кількість лайків станом на 00:00 годин 1 листопада.',
        ]
      : [
          'Участь у конкурсі можуть брати юридичні особи та фізичні особи – підприємці всіх видів діяльності та форм власності з території всієї України, які дбають про ментальне здоров\'я своїх працівників та запровадили або запроваджують психосоціальну підтримку працівників на робочому місці.',
          'Для участі уповноважений представник роботодавця має зареєструватися та завантажити презентаційні матеріали: презентацію у форматі pdf та/або відеоролик у форматі mp4.',
          'Реєстрація та завантаження матеріалів триватиме з 28.04.2025 по 20.07.2025.',
          'Для оцінки відповідності матеріалів заявленій темі Держпраці створюється журі за участі представників центральний органів виконавчої влади та сторін соціального діалогу. Мінімальна кількість членів журі – 7 осіб.',
          'Після вивчення журі отриманих матеріалів на відповідність заявленій темі вони розміщуються на порталі та стають доступними для всіх бажаючих (без можливості завантаження) для розгляду та голосування. Голосування триватиме з 1 серпня по 31 жовтня включно.',
          'Програми, що наберуть найбільшу кількість голосів, будуть відзначені Держпраці.',
        ],
    support: {
      title: (isVoteEnabled: boolean) => isVoteEnabled ? 'Підтримайте наших учасників своїми «лайками»!' : '',
      content: (isVoteEnabled: boolean) => isVoteEnabled ? 'Дякуємо за активну участь та підтримку проєкту!' : '',
    },
    winners: {
      title: 'Переможці та Відзнаки',
      content: 'Результати конкурсу будуть оголошені в період з 1 по 7 листопада. Переможці отримають відзнаки від Держпраці, а інформація про них буде розміщена на інформаційних ресурсах Держпраці, її територіальних органів та партнерів.'
    },
    final: (isVoteEnabled: boolean) => isVoteEnabled ? 'Дякуємо за вашу активну участь та підтримку! Голосуйте за майбутнє здорової праці разом з нами!' : ''
  },
  [Pages.art]: {
    category: 'Мистецтво, що рятує життя',
    title: (isVoteEnabled: boolean) => isVoteEnabled 
      ? 'Онлайн голосування - Мистецтво, що рятує життя'
      : 'Мистецтво, що рятує життя',
    subtitle: (isVoteEnabled: boolean) => isVoteEnabled
      ? 'Вітаємо на сторінці голосування!\nМи раді представити вам найкращі роботи у номінації «Мистецтво, що рятує життя». Ваш голос допоможе визначити найкращих. Переглядайте роботи і обирайте ті, що найбільш вас надихнули.'
      : 'Цей розділ для творців. Хто сказав, що інструкції мають бути сухими і нецікавими? Якщо ви знаєте, як зробити інформаційний плакат, колаж або відео про охорону праці цікавим і корисним – чекаємо на вас!',
    img: images.categories.category4,
    description: (isVoteEnabled: boolean) => isVoteEnabled
      ? [
          'Переглянути всі роботи. Прокручуйте сторінку вниз, щоб переглянути всі роботи.',
          'Поставте лайки (натисніть на значок «лайк» під кожною роботою, що вам сподобається. Ви можете голосувати за необмежену кількість робіт.',
          'Голосування триватиме з 1 липня по 31 жовтня включно. Переможцями стануть програми, що отримають найбільшу кількість лайків станом на 00:00 годин 1 листопада.',
        ]
      : [
          'Участь у конкурсі можуть брати всі бажаючі без обмеження за віком, зайнятістю та місцем проживання.',
          'До участі у конкурсі приймаються візуальні матеріали та зображення на теми охорони праці, здорового робочого місця, безпечного виконання робіт, зокрема:\na. Постери чи інформаційні плакати, створені вручну або за допомогою програмного забезпечення;\nb. Художні фото, колажі чи зображення, створені на основі фото;\nc. Відеоролики (мультиплікаційні, документальні, художні).',
          'Роботи мають бути створені учасниками особисто і відповідати заявленій темі. Роботи на інші теми до участі не допускаються.',
          'Для участі у конкурсі учасники особисто реєструються на порталі та завантажують свої роботи у форматі jpg, jpeg або png до 20.07.2025. У разі, якщо учасник є неповнолітнім, до заявки долучається згода одного з батьків вільної форми.',
          'Конкурс відбувається в два етапи: обласний та національний.',
          'Для оцінки робіт при міжрегіональних управліннях Держпраці створюються журі за участі представників соціальних партнерів, органів місцевої влади та місцевого самоврядування. Мінімальна кількість членів журі – 7 осіб в області. Склад журі затверджується керівником відповідного міжрегіонального управління.',
          'Журі міжрегіонального управління Держпраці оцінює зміст робіт на відповідність заявлений темі та визначає переможців 1 етапу. Про перемогу на 1 етапі учасники повідомляються шляхом направлення відповідного повідомлення на електронну пошту.',
          'Роботи – переможці 1 етапу розміщуються на платформі для онлайн голосування, яке відкривається 1 липня і триває по 31 жовтня включно.',
          'Результати конкурсу оголошуються в період з 1 по 10 листопада шляхом розміщення інформації на вебсайті Держпраці.',
          'Переможці конкурсу будуть відзначені Держпраці. Інформація про переможців конкурсу буде розміщена на інформаційних ресурсах Держпраці, її територіальних органів та партнерів.',
        ],
    support: {
      title: (isVoteEnabled: boolean) => isVoteEnabled ? 'Підтримайте наших учасників своїми «лайками»!' : '',
      content: (isVoteEnabled: boolean) => isVoteEnabled ? 'Дякуємо за активну участь та підтримку проєкту!' : '',
    },
    winners: {
      title: '',
      content: ''
    },
    final: (isVoteEnabled: boolean) => ''
  },
};